* Extract the normalized Razor protein hits
  
|-------------------------------+-----------------------------------------|
| Inputs                        | Outputs                                 |
|-------------------------------+-----------------------------------------|
| proteinGroupsGoodColNames.csv | good_prot_hits_norm.csv                 |
| proteinGroups.txt             | good_prot_hits_norm_organelles.csv      |
| proteinGroupsGoodColNames.csv | full_good_prot_hits_norm.csv            |
| proteinGroups.txt             | full_good_prot_hits_norm_organelles.csv |
|-------------------------------+-----------------------------------------|
  
#+BEGIN_SRC ipython :session
import pandas as pd

def process_raw(input_file, output_file, sep=",", cols=False, full=False):
    protein_groups = pd.read_csv(input_file, sep=sep)
    good_prots = protein_groups[~(protein_groups['Protein IDs'].str.contains("CON")) &
                                ~(protein_groups['Protein IDs'].str.contains("REV"))]
    razors = [i for i in good_prots.columns if "Razor" in i][1:]
    razors = ['Protein IDs'] + razors
    good_prot_hits = good_prots[razors]
    good_prot_hits = good_prot_hits.set_index('Protein IDs')
    if not full:
        good_prot_hits.index = [".".join(i.split(".")[:2]) for i in good_prot_hits.index]
    good_prot_hits_norm = good_prot_hits/good_prot_hits.sum(axis=0)
    if cols:
        good_prot_hits_norm.columns = cols
        good_prot_hits_norm.to_csv(output_file)
    else:
        good_prot_hits_norm.to_csv(output_file)
        cols = list(good_prot_hits_norm.columns)
        return(cols)

columns_names = process_raw("proteinGroupsGoodColNames.csv", "good_prot_hits_norm.csv")
process_raw("proteinGroups.txt", "good_prot_hits_norm_organelles.csv", sep="\t", cols=columns_names)
process_raw("proteinGroupsGoodColNames.csv", "full_good_prot_hits_norm.csv", full=True)
process_raw("proteinGroups.txt", "full_good_prot_hits_norm_organelles.csv", sep="\t", cols=columns_names, full=True)
#+END_SRC

#+RESULTS:
: # Out[11]:


|-----------------------------------------+--------------------------------|
| Inputs                                  | Outputs                        |
|-----------------------------------------+--------------------------------|
| good_prot_hits_norm.csv                 | prot_table.csv                 |
| good_prot_hits_norm_organelles.csv      | prot_table_organelles.csv      |
| full_good_prot_hits_norm.csv            | full_prot_table.csv            |
| full_good_prot_hits_norm_organelles.csv | full_prot_table_organelles.csv |
|-----------------------------------------+--------------------------------|

#+BEGIN_SRC ipython :session
import pandas as pd

def table_convert(input_file, output_file):
    gphn = pd.read_csv(input_file)
    gphn.index = gphn.iloc[:,0]
    gphn = gphn.iloc[:,1:gphn.shape[0]]
    gphn = gphn.transpose()
    gphn.index = [i.split()[4] for i in list(gphn.index)]
    gphn.to_csv(output_file)
    
table_convert("good_prot_hits_norm.csv", "prot_table.csv")
table_convert("good_prot_hits_norm_organelles.csv", "prot_table_organelles.csv")
table_convert("full_good_prot_hits_norm.csv", "full_prot_table.csv")
table_convert("full_good_prot_hits_norm_organelles.csv", "full_prot_table_organelles.csv")
#+END_SRC

#+RESULTS:
: # Out[12]:


* Subtract the control means from the data
  
|--------------------------------+--------------------------------------|
| Inputs                         | Outputs                              |
|--------------------------------+--------------------------------------|
| prot_table.csv                 | mean_corrected.csv                   |
|                                | median_corrected.csv                 |
| full_prot_table.csv            | full_corrected_mean.csv              |
|                                | full_median_corrected.csv            |
| prot_table_organelles.csv      | mean_corrected_organelles.csv        |
|                                | median_corrected_organelles.csv      |
| full_prot_table_organelles.csv | full_mean_corrected_organelles.csv   |
|                                | full_median_corrected_organelles.csv |
|--------------------------------+--------------------------------------|

#+BEGIN_SRC ipython :session
import pandas as pd

def subtract_means(input_file, mean_output_file, median_output_file):
    gphn = pd.read_csv(input_file, index_col=0)
    gphn['Strain'] = [i.split("_")[0] for i in list(gphn.index)]
    gphn['Treatment'] = [i.split("_")[1] for i in list(gphn.index)]
    gphn['Replicate'] = [i.split("_")[2] for i in list(gphn.index)]
    gphn.loc[gphn['Treatment'] == 'C', 'Replicate'] = 'r1'
    gphn.loc[gphn['Replicate'] == 'r1.1', 'Replicate'] = 'r1'
    control_means = gphn[gphn['Treatment'] == 'control'] \
                    .groupby(['Strain', 'Treatment']).mean() \
                    .reset_index().drop('Treatment', 1).set_index('Strain')
    control_medians = gphn[gphn['Treatment'] == 'control'] \
                      .groupby(['Strain', 'Treatment']).median() \
                      .reset_index().drop('Treatment', 1).set_index('Strain')
    mean_corrected = gphn.drop('Replicate', 1).set_index('Strain') \
                         .groupby('Treatment').apply(lambda x: x - control_means)
    median_corrected = gphn.drop('Replicate', 1).set_index('Strain') \
                           .groupby('Treatment').apply(lambda x: x - control_medians)
    mean_corrected.drop('Treatment', 1).drop_duplicates().to_csv(mean_output_file)
    median_corrected.drop('Treatment', 1).drop_duplicates().to_csv(median_output_file)

subtract_means("prot_table.csv",
               "mean_corrected.csv",
               "median_corrected.csv")
subtract_means("full_prot_table.csv",
               "full_mean_corrected.csv",
               "full_median_corrected.csv")
subtract_means("prot_table_organelles.csv",
               "mean_corrected_organelles.csv",
               "median_corrected_organelles.csv")
subtract_means("full_prot_table_organelles.csv",
               "full_mean_corrected_organelles.csv",
               "full_median_corrected_organelles.csv")
#+END_SRC

#+RESULTS:
: # Out[9]:


